bench/results/run_smoke_20260727_095712/html_report/statistics.json
{
  "GET /users/admin/reports/overview" : {
    "transaction" : "GET /users/admin/reports/overview",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 134.0,
    "medianResTime" : 134.0,
    "minResTime" : 134.0,
    "maxResTime" : 134.0,
    "pct1ResTime" : 134.0,
    "pct2ResTime" : 134.0,
    "pct3ResTime" : 134.0,
    "throughput" : 7.462686567164179,
    "receivedKBytesPerSec" : 8.927530317164178,
    "sentKBytesPerSec" : 3.6876166044776117
  },
  "GET /users/admin/sentiment/overview" : {
    "transaction" : "GET /users/admin/sentiment/overview",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 197.0,
    "medianResTime" : 197.0,
    "minResTime" : 197.0,
    "maxResTime" : 197.0,
    "pct1ResTime" : 197.0,
    "pct2ResTime" : 197.0,
    "pct3ResTime" : 197.0,
    "throughput" : 5.076142131979695,
    "receivedKBytesPerSec" : 6.196462563451776,
    "sentKBytesPerSec" : 2.518242385786802
  },
  "GET /notifications/unread-count" : {
    "transaction" : "GET /notifications/unread-count",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 79.0,
    "medianResTime" : 79.0,
    "minResTime" : 79.0,
    "maxResTime" : 79.0,
    "pct1ResTime" : 79.0,
    "pct2ResTime" : 79.0,
    "pct3ResTime" : 79.0,
    "throughput" : 12.658227848101266,
    "receivedKBytesPerSec" : 13.746044303797468,
    "sentKBytesPerSec" : 6.341475474683544
  },
  "POST /users/posts (Create Post)" : {
    "transaction" : "POST /users/posts (Create Post)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 251.0,
    "medianResTime" : 251.0,
    "minResTime" : 251.0,
    "maxResTime" : 251.0,
    "pct1ResTime" : 251.0,
    "pct2ResTime" : 251.0,
    "pct3ResTime" : 251.0,
    "throughput" : 3.9840637450199203,
    "receivedKBytesPerSec" : 6.088925547808765,
    "sentKBytesPerSec" : 2.420007470119522
  },
  "GET /users/search" : {
    "transaction" : "GET /users/search",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 516.0,
    "medianResTime" : 516.0,
    "minResTime" : 516.0,
    "maxResTime" : 516.0,
    "pct1ResTime" : 516.0,
    "pct2ResTime" : 516.0,
    "pct3ResTime" : 516.0,
    "throughput" : 1.937984496124031,
    "receivedKBytesPerSec" : 3.673464752906977,
    "sentKBytesPerSec" : 0.9349261143410852
  },
  "GET /users/friends/suggestions" : {
    "transaction" : "GET /users/friends/suggestions",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 179.0,
    "medianResTime" : 179.0,
    "minResTime" : 179.0,
    "maxResTime" : 179.0,
    "pct1ResTime" : 179.0,
    "pct2ResTime" : 179.0,
    "pct3ResTime" : 179.0,
    "throughput" : 5.58659217877095,
    "receivedKBytesPerSec" : 11.053159916201118,
    "sentKBytesPerSec" : 2.793296089385475
  },
  "GET /users/posts/{postId}/comments (List Comments)" : {
    "transaction" : "GET /users/posts/{postId}/comments (List Comments)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 86.0,
    "medianResTime" : 86.0,
    "minResTime" : 86.0,
    "maxResTime" : 86.0,
    "pct1ResTime" : 86.0,
    "pct2ResTime" : 86.0,
    "pct3ResTime" : 86.0,
    "throughput" : 11.627906976744185,
    "receivedKBytesPerSec" : 17.623546511627907,
    "sentKBytesPerSec" : 5.802598110465117
  },
  "POST /users/posts/{postId}/comments (Create Comment)" : {
    "transaction" : "POST /users/posts/{postId}/comments (Create Comment)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 109.0,
    "medianResTime" : 109.0,
    "minResTime" : 109.0,
    "maxResTime" : 109.0,
    "pct1ResTime" : 109.0,
    "pct2ResTime" : 109.0,
    "pct3ResTime" : 109.0,
    "throughput" : 9.174311926605505,
    "receivedKBytesPerSec" : 13.367259174311927,
    "sentKBytesPerSec" : 5.2770212155963305
  },
  "GET /chat/conversations/online" : {
    "transaction" : "GET /chat/conversations/online",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 75.0,
    "medianResTime" : 75.0,
    "minResTime" : 75.0,
    "maxResTime" : 75.0,
    "pct1ResTime" : 75.0,
    "pct2ResTime" : 75.0,
    "pct3ResTime" : 75.0,
    "throughput" : 13.333333333333334,
    "receivedKBytesPerSec" : 14.401041666666668,
    "sentKBytesPerSec" : 6.549479166666667
  },
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 660.0,
    "medianResTime" : 660.0,
    "minResTime" : 660.0,
    "maxResTime" : 660.0,
    "pct1ResTime" : 660.0,
    "pct2ResTime" : 660.0,
    "pct3ResTime" : 660.0,
    "throughput" : 1.5151515151515151,
    "receivedKBytesPerSec" : 2.4488044507575757,
    "sentKBytesPerSec" : 0.3995028409090909
  },
  "GET /chat/conversations/user/{userId}" : {
    "transaction" : "GET /chat/conversations/user/{userId}",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 201.0,
    "medianResTime" : 201.0,
    "minResTime" : 201.0,
    "maxResTime" : 201.0,
    "pct1ResTime" : 201.0,
    "pct2ResTime" : 201.0,
    "pct3ResTime" : 201.0,
    "throughput" : 4.975124378109452,
    "receivedKBytesPerSec" : 27.620685634328357,
    "sentKBytesPerSec" : 2.4438355099502487
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 17,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 190.47058823529412,
    "medianResTime" : 118.0,
    "minResTime" : 75.0,
    "maxResTime" : 660.0,
    "pct1ResTime" : 544.8,
    "pct2ResTime" : 660.0,
    "pct3ResTime" : 660.0,
    "throughput" : 2.1634003563247646,
    "receivedKBytesPerSec" : 4.537573173835582,
    "sentKBytesPerSec" : 1.0903995132349198
  },
  "GET /users/{id}/profile" : {
    "transaction" : "GET /users/{id}/profile",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 237.0,
    "medianResTime" : 237.0,
    "minResTime" : 237.0,
    "maxResTime" : 237.0,
    "pct1ResTime" : 237.0,
    "pct2ResTime" : 237.0,
    "pct3ResTime" : 237.0,
    "throughput" : 4.219409282700422,
    "receivedKBytesPerSec" : 6.877142668776371,
    "sentKBytesPerSec" : 2.0314148206751055
  },
  "GET /auth/validate-token" : {
    "transaction" : "GET /auth/validate-token",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 78.0,
    "medianResTime" : 78.0,
    "minResTime" : 78.0,
    "maxResTime" : 78.0,
    "pct1ResTime" : 78.0,
    "pct2ResTime" : 78.0,
    "pct3ResTime" : 78.0,
    "throughput" : 12.82051282051282,
    "receivedKBytesPerSec" : 14.435596955128204,
    "sentKBytesPerSec" : 8.613782051282051
  },
  "GET /users/posts/suggested (Feed)" : {
    "transaction" : "GET /users/posts/suggested (Feed)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 118.0,
    "medianResTime" : 118.0,
    "minResTime" : 118.0,
    "maxResTime" : 118.0,
    "pct1ResTime" : 118.0,
    "pct2ResTime" : 118.0,
    "pct3ResTime" : 118.0,
    "throughput" : 8.474576271186441,
    "receivedKBytesPerSec" : 51.19504766949153,
    "sentKBytesPerSec" : 4.270391949152542
  },
  "GET /users/groups/suggested" : {
    "transaction" : "GET /users/groups/suggested",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 101.0,
    "medianResTime" : 101.0,
    "minResTime" : 101.0,
    "maxResTime" : 101.0,
    "pct1ResTime" : 101.0,
    "pct2ResTime" : 101.0,
    "pct3ResTime" : 101.0,
    "throughput" : 9.900990099009901,
    "receivedKBytesPerSec" : 26.521890470297027,
    "sentKBytesPerSec" : 4.921488242574257
  },
  "POST /users/posts/{id}/like" : {
    "transaction" : "POST /users/posts/{id}/like",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 106.0,
    "medianResTime" : 106.0,
    "minResTime" : 106.0,
    "maxResTime" : 106.0,
    "pct1ResTime" : 106.0,
    "pct2ResTime" : 106.0,
    "pct3ResTime" : 106.0,
    "throughput" : 9.433962264150942,
    "receivedKBytesPerSec" : 10.032797759433963,
    "sentKBytesPerSec" : 4.892025353773585
  },
  "GET /users/groups/joined" : {
    "transaction" : "GET /users/groups/joined",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 111.0,
    "medianResTime" : 111.0,
    "minResTime" : 111.0,
    "maxResTime" : 111.0,
    "pct1ResTime" : 111.0,
    "pct2ResTime" : 111.0,
    "pct3ResTime" : 111.0,
    "throughput" : 9.00900900900901,
    "receivedKBytesPerSec" : 26.947846283783782,
    "sentKBytesPerSec" : 4.451717342342342
  }
}