bench/results/stress_20260727_100023/step_75_users/html_report/statistics.json
{
  "GET /users/admin/reports/overview" : {
    "transaction" : "GET /users/admin/reports/overview",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 204.58933333333314,
    "medianResTime" : 165.0,
    "minResTime" : 84.0,
    "maxResTime" : 871.0,
    "pct1ResTime" : 371.19999999999993,
    "pct2ResTime" : 456.0,
    "pct3ResTime" : 682.7200000000003,
    "throughput" : 8.033820599430134,
    "receivedKBytesPerSec" : 9.644552812997652,
    "sentKBytesPerSec" : 3.9698371321402814
  },
  "GET /users/admin/sentiment/overview" : {
    "transaction" : "GET /users/admin/sentiment/overview",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 260.1066666666659,
    "medianResTime" : 237.0,
    "minResTime" : 111.0,
    "maxResTime" : 745.0,
    "pct1ResTime" : 400.0,
    "pct2ResTime" : 466.0,
    "pct3ResTime" : 589.44,
    "throughput" : 8.032042494859493,
    "receivedKBytesPerSec" : 9.823634195796208,
    "sentKBytesPerSec" : 3.9846460814342017
  },
  "GET /notifications/unread-count" : {
    "transaction" : "GET /notifications/unread-count",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 96.896,
    "medianResTime" : 79.0,
    "minResTime" : 61.0,
    "maxResTime" : 669.0,
    "pct1ResTime" : 116.39999999999998,
    "pct2ResTime" : 225.4000000000001,
    "pct3ResTime" : 423.48,
    "throughput" : 8.035140347118062,
    "receivedKBytesPerSec" : 8.712184620741375,
    "sentKBytesPerSec" : 4.025416990304264
  },
  "POST /users/posts (Create Post)" : {
    "transaction" : "POST /users/posts (Create Post)",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 185.05955555555556,
    "medianResTime" : 139.0,
    "minResTime" : 79.0,
    "maxResTime" : 1200.0,
    "pct1ResTime" : 328.0,
    "pct2ResTime" : 417.70000000000005,
    "pct3ResTime" : 657.96,
    "throughput" : 8.033017486986513,
    "receivedKBytesPerSec" : 12.338561451691218,
    "sentKBytesPerSec" : 4.884102524509629
  },
  "GET /users/search" : {
    "transaction" : "GET /users/search",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 164.10133333333312,
    "medianResTime" : 118.0,
    "minResTime" : 66.0,
    "maxResTime" : 1038.0,
    "pct1ResTime" : 314.0,
    "pct2ResTime" : 387.8000000000002,
    "pct3ResTime" : 520.0,
    "throughput" : 8.03307484683604,
    "receivedKBytesPerSec" : 15.183801494241179,
    "sentKBytesPerSec" : 3.8753310296259804
  },
  "GET /users/friends/suggestions" : {
    "transaction" : "GET /users/friends/suggestions",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 384.8017777777778,
    "medianResTime" : 369.0,
    "minResTime" : 148.0,
    "maxResTime" : 1292.0,
    "pct1ResTime" : 577.0,
    "pct2ResTime" : 660.7,
    "pct3ResTime" : 919.5000000000002,
    "throughput" : 8.029921271083003,
    "receivedKBytesPerSec" : 15.92011354754784,
    "sentKBytesPerSec" : 4.014960635541502
  },
  "GET /users/posts/{postId}/comments (List Comments)" : {
    "transaction" : "GET /users/posts/{postId}/comments (List Comments)",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 161.4204444444446,
    "medianResTime" : 118.0,
    "minResTime" : 66.0,
    "maxResTime" : 885.0,
    "pct1ResTime" : 310.0,
    "pct2ResTime" : 371.70000000000005,
    "pct3ResTime" : 611.9200000000001,
    "throughput" : 8.034336970805006,
    "receivedKBytesPerSec" : 12.036817683932755,
    "sentKBytesPerSec" : 4.017168485402502
  },
  "POST /users/posts/{postId}/comments (Create Comment)" : {
    "transaction" : "POST /users/posts/{postId}/comments (Create Comment)",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 204.42133333333325,
    "medianResTime" : 156.0,
    "minResTime" : 82.0,
    "maxResTime" : 1038.0,
    "pct1ResTime" : 353.0,
    "pct2ResTime" : 494.0,
    "pct3ResTime" : 704.8800000000001,
    "throughput" : 8.033591122346238,
    "receivedKBytesPerSec" : 11.727815684426258,
    "sentKBytesPerSec" : 4.649956908709841
  },
  "GET /chat/conversations/online" : {
    "transaction" : "GET /chat/conversations/online",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 96.39288888888883,
    "medianResTime" : 79.0,
    "minResTime" : 61.0,
    "maxResTime" : 717.0,
    "pct1ResTime" : 117.39999999999998,
    "pct2ResTime" : 207.70000000000005,
    "pct3ResTime" : 448.0,
    "throughput" : 8.035140347118062,
    "receivedKBytesPerSec" : 8.63513934272552,
    "sentKBytesPerSec" : 3.9469488228519394
  },
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 609.0,
    "medianResTime" : 609.0,
    "minResTime" : 609.0,
    "maxResTime" : 609.0,
    "pct1ResTime" : 609.0,
    "pct2ResTime" : 609.0,
    "pct3ResTime" : 609.0,
    "throughput" : 1.6420361247947455,
    "receivedKBytesPerSec" : 2.647462541050903,
    "sentKBytesPerSec" : 0.43295874384236455
  },
  "GET /chat/conversations/user/{userId}" : {
    "transaction" : "GET /chat/conversations/user/{userId}",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 101.720888888889,
    "medianResTime" : 81.0,
    "minResTime" : 62.0,
    "maxResTime" : 614.0,
    "pct1ResTime" : 134.0,
    "pct2ResTime" : 240.4000000000001,
    "pct3ResTime" : 459.2800000000002,
    "throughput" : 8.034968181526,
    "receivedKBytesPerSec" : 44.62877303134351,
    "sentKBytesPerSec" : 3.946864253230057
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 16877,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 192.21218225988036,
    "medianResTime" : 147.0,
    "minResTime" : 61.0,
    "maxResTime" : 1292.0,
    "pct1ResTime" : 370.2000000000007,
    "pct2ResTime" : 458.0,
    "pct3ResTime" : 651.0,
    "throughput" : 114.94871340807236,
    "receivedKBytesPerSec" : 249.27883551170805,
    "sentKBytesPerSec" : 58.53872349469085
  },
  "GET /users/{id}/profile" : {
    "transaction" : "GET /users/{id}/profile",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 173.74222222222247,
    "medianResTime" : 141.0,
    "minResTime" : 63.0,
    "maxResTime" : 1113.0,
    "pct1ResTime" : 304.0,
    "pct2ResTime" : 384.10000000000014,
    "pct3ResTime" : 602.7,
    "throughput" : 8.023564316891564,
    "receivedKBytesPerSec" : 12.96937433359841,
    "sentKBytesPerSec" : 3.8629074299097086
  },
  "GET /auth/validate-token" : {
    "transaction" : "GET /auth/validate-token",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 76.0,
    "medianResTime" : 76.0,
    "minResTime" : 76.0,
    "maxResTime" : 76.0,
    "pct1ResTime" : 76.0,
    "pct2ResTime" : 76.0,
    "pct3ResTime" : 76.0,
    "throughput" : 13.157894736842104,
    "receivedKBytesPerSec" : 14.635587993421053,
    "sentKBytesPerSec" : 8.84046052631579
  },
  "GET /users/posts/suggested (Feed)" : {
    "transaction" : "GET /users/posts/suggested (Feed)",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 248.71644444444453,
    "medianResTime" : 220.0,
    "minResTime" : 98.0,
    "maxResTime" : 952.0,
    "pct1ResTime" : 405.0,
    "pct2ResTime" : 489.4000000000001,
    "pct3ResTime" : 702.3200000000002,
    "throughput" : 8.031526418367566,
    "receivedKBytesPerSec" : 45.543572313632886,
    "sentKBytesPerSec" : 4.047136359255531
  },
  "GET /users/groups/suggested" : {
    "transaction" : "GET /users/groups/suggested",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 195.49688888888886,
    "medianResTime" : 158.0,
    "minResTime" : 79.0,
    "maxResTime" : 718.0,
    "pct1ResTime" : 341.4,
    "pct2ResTime" : 418.70000000000005,
    "pct3ResTime" : 556.2800000000002,
    "throughput" : 8.033877970749543,
    "receivedKBytesPerSec" : 21.507256209741342,
    "sentKBytesPerSec" : 3.9934022335073407
  },
  "POST /users/posts/{id}/like" : {
    "transaction" : "POST /users/posts/{id}/like",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 194.7377777777777,
    "medianResTime" : 153.0,
    "minResTime" : 80.0,
    "maxResTime" : 969.0,
    "pct1ResTime" : 339.79999999999995,
    "pct2ResTime" : 439.4000000000001,
    "pct3ResTime" : 662.48,
    "throughput" : 8.03353375512361,
    "receivedKBytesPerSec" : 8.576041357970693,
    "sentKBytesPerSec" : 4.173671833716562
  },
  "GET /users/groups/joined" : {
    "transaction" : "GET /users/groups/joined",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 210.7119999999998,
    "medianResTime" : 181.0,
    "minResTime" : 85.0,
    "maxResTime" : 1045.0,
    "pct1ResTime" : 356.4,
    "pct2ResTime" : 432.0,
    "pct3ResTime" : 555.7,
    "throughput" : 8.033763228930118,
    "receivedKBytesPerSec" : 24.064335770687833,
    "sentKBytesPerSec" : 3.969808783045546
  }
}